using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Loto
{
    class Program
    {
        static void Main(string[] args)
        {
            var n1 = new Draw("Сряда, 23 Декември 2015", 3, 9, 18, 27, 28, 39);
            var n2 = new Draw("Сряда, 30 Декември 2015", 3, 7, 22, 28, 44, 47);
            var n3 = new Draw("Сряда, 06 Януари 2016", 1, 7, 37, 38, 41, 42);
            var n4 = new Draw("Сряда, 13 Януари 2016", 10, 21, 22, 28, 31, 42);
            var n5 = new Draw("Сряда, 20 Януари 2016", 9, 19, 32, 35, 37, 43);
            var n6 = new Draw("Сряда, 27 Януари 2016", 7, 13, 20, 24, 28, 44);
            var n7 = new Draw("Сряда, 03 Февруари 2016", 7, 10, 12, 23, 37, 47);
            var n8 = new Draw("Сряда, 10 Февруари 2016", 3, 16, 26, 28, 30, 38);
            var n9 = new Draw("Сряда, 17 Февруари 2016", 15, 20, 25, 39, 44, 46);
            var n10 = new Draw("Сряда, 24 Февруари 2016", 11, 15, 24, 25, 31, 40);
            var n11 = new Draw("Сряда, 02 Март 2016", 3, 9, 30, 31, 46, 47);
            var n12 = new Draw("Сряда, 09 Март 2016", 13, 18, 26, 32, 34, 46);
            var n13 = new Draw("Сряда, 16 Март 2016", 2, 5, 9, 13, 16, 17);
            var n14 = new Draw("Сряда, 23 Март 2016", 12, 14, 24, 25, 31, 33);
            var n15 = new Draw("Сряда, 30 Март 2016", 4, 7, 18, 30, 40, 44);
            var n16 = new Draw("Сряда, 06 Април 2016", 2, 5, 6, 7, 34, 42);
            var n17 = new Draw("Сряда, 13 Април 2016", 3, 4, 11, 13, 24, 40);
            var n18 = new Draw("Сряда, 20 Април 2016", 13, 16, 17, 30, 31, 47);
            var n19 = new Draw("Сряда, 27 Април 2016", 5, 6, 9, 24, 33, 36);
            var n20 = new Draw("Сряда, 04 Май 2016", 9, 12, 20, 24, 37, 38);
            var n21 = new Draw("Сряда, 11 Май 2016", 11, 21, 35, 39, 41, 43);
            var n22 = new Draw("Сряда, 18 Май 2016", 18, 23, 24, 27, 37, 45);
            var n23 = new Draw("Сряда, 25 Май 2016", 8, 14, 22, 34, 41, 47);
            var n24 = new Draw("Сряда, 01 Юни 2016", 1, 22, 31, 42, 45, 46);
            var n25 = new Draw("Сряда, 08 Юни 2016", 11, 14, 27, 32, 35, 46);
            var n26 = new Draw("Сряда, 15 Юни 2016", 1, 21, 25, 28, 33, 40);
            var n27 = new Draw("Сряда, 22 Юни 2016", 2, 10, 19, 22, 23, 28);
            var n28 = new Draw("Сряда, 29 Юни 2016", 9, 12, 19, 33, 38, 42);
            var n29 = new Draw("Сряда, 06 Юли 2016", 5, 8, 11, 21, 23, 42);
            var n30 = new Draw("Сряда, 13 Юли 2016", 3, 10, 12, 17, 22, 42);
            var n31 = new Draw("Сряда, 20 Юли 2016", 22, 28, 36, 41, 43, 46);
            var n32 = new Draw("Сряда, 27 Юли 2016", 3, 9, 17, 21, 29, 44);
            var n33 = new Draw("Сряда, 03 Август 2016", 2, 15, 25, 31, 44, 47);
            var n34 = new Draw("Сряда, 10 Август 2016", 1, 3, 17, 18, 20, 33);
            var n35 = new Draw("Сряда, 17 Август 2016", 1, 20, 21, 25, 33, 43);
            var n36 = new Draw("Сряда, 24 Август 2016", 13, 19, 23, 25, 31, 42);
            var n37 = new Draw("Сряда, 31 Август 2016", 5, 8, 18, 33, 34, 45);
            var n38 = new Draw("Петък, 02 Септември 2016", 14, 15, 20, 23, 29, 43);
            var n39 = new Draw("Сряда, 07 Септември 2016", 5, 10, 21, 30, 34, 46);
            var n40 = new Draw("Петък, 09 Септември 2016", 3, 12, 15, 25, 28, 33);
            var n41 = new Draw("Сряда, 14 Септември 2016", 10, 12, 26, 29, 41, 46);
            var n42 = new Draw("Петък, 16 Септември 2016", 19, 28, 31, 32, 40, 46);
            var n43 = new Draw("Сряда, 21 Септември 2016", 3, 14, 24, 37, 38, 43);
            var n44 = new Draw("Петък, 23 Септември 2016", 10, 19, 20, 22, 31, 47);
            var n45 = new Draw("Сряда, 28 Септември 2016", 5, 9, 11, 23, 38, 41);
            var n46 = new Draw("Петък, 30 Септември 2016", 12, 18, 25, 27, 28, 31);
            var n47 = new Draw("Сряда, 05 Октомври 2016", 6, 13, 14, 17, 22, 37);
            var n48 = new Draw("Петък, 07 Октомври 2016", 4, 6, 28, 32, 40, 46);
            var n49 = new Draw("Сряда, 12 Октомври 2016", 2, 3, 8, 30, 35, 47);
            var n50 = new Draw("Петък, 14 Октомври 2016", 9, 23, 27, 32, 35, 43);
            var n51 = new Draw("Сряда, 19 Октомври 2016", 3, 10, 28, 31, 35, 44);
            var n52 = new Draw("Петък, 21 Октомври 2016", 1, 3, 14, 16, 18, 47);
            var n53 = new Draw("Сряда, 26 Октомври 2016", 9, 25, 29, 32, 33, 44);
            var n54 = new Draw("Петък, 28 Октомври 2016", 11, 17, 25, 27, 28, 33);
            var n55 = new Draw("Сряда, 02 Ноември 2016", 6, 20, 29, 31, 32, 42);
            var n56 = new Draw("Петък, 04 Ноември 2016", 8, 9, 13, 34, 38, 43);
            var n57 = new Draw("Сряда, 09 Ноември 2016", 1, 5, 21, 24, 29, 38);
            var n58 = new Draw("Петък, 11 Ноември 2016", 7, 20, 21, 28, 29, 40);
            var n59 = new Draw("Сряда, 16 Ноември 2016", 5, 14, 27, 33, 36, 39);
            var n60 = new Draw("Петък, 18 Ноември 2016", 13, 17, 23, 35, 44, 46);
            var n61 = new Draw("Петък, 25 Ноември 2016", 9, 18, 20, 21, 27, 38);
            var n63 = new Draw("Сряда, 23 Ноември 2016", 5, 21, 31, 35, 43, 44);
            //var n62 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);

            //var n64 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            //var n65 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            //var n66 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            //var n67 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            //var n68 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            //var n69 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            //var n70 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            //var n71 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            //var n72 = new Draw("Петък, 04 Ноември 2016", 33, 34, 35, 36, 38, 37);
            Draw.Print();
            Console.WriteLine();
            Draw.MostPickedNumbers(8);


        }
    }
}
